# =================================
#       Операции с числами
# =================================
x = 10
y = 5
z = 2
a = 56
print(''.center(60, '='))
print('Операции с числами'.center(60, '-'))
print(''.center(60, '='))

print('Пример сложения и вывода двух переменных!')
print(''.center(60, '-'))
print(f'{x} + {y} = {x + y}')

print(''.center(60, '-'))
print('Пример вычитания и вывода двух переменных!')
print(''.center(60, '-'))
print(f'{x} - {y} = {x - y}')

print(''.center(60, '-'))
print('Пример умножения и вывода двух переменных!')
print(''.center(60, '-'))
print(f'{x} * {y} = {x * y}')

print(''.center(60, '-'))
print('Пример деления и вывода двух переменных!')
print(''.center(60, '-'))
print(f'{x} / {y} = {x / y}')

print(''.center(60, '-'))
print('Пример использования нескольких переменных для вычислений!')
print(''.center(60, '-'))
print(f'{x} * {a} / {z} * {y}  = {x * a / z * y}')

print(''.center(60, '-'))
print('Пример целочисленного деления и вывод!')
print(''.center(60, '-'))
print(f'{x} // {y} = {x // y}')

print(''.center(60, '-'))
print('Пример остатка от деления!')
print(''.center(60, '-'))
print(f'{x} % {y} = {x % y}')

print(''.center(60, '-'))
print('Возведение в степень!')
print(''.center(60, '-'))
print(f'{x} ** {y} = {x ** y}')

print(''.center(60, '-'))
print('Определяем положительность или отрицателность числа!')
print(''.center(60, '-'))
num = int(input('Введите любое число: '))
if num > 0:
    print(f'{num} положительное число!')
else:
    print(f'{num} отрицательное число!')
